Revit 2027 API
SizingOptions Constructor
 Constructs a new instance of the SizingOptions with default parameters.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SizingOptions()
Public Sub New
public:
SizingOptions()
new : unit -> SizingOptions
Remarks
 The default SizingOptions represents a round duct profile with the air density and viscosity values.
See Also
Reference
SizingOptions Class
SizingOptions Overload
Autodesk.Revit.DB.Analysis Namespace